MOVE 0 TO WS-COUNTER.

PERFORM VARYING WS-SUB1 FROM 1 BY 1 UNTIL WS-SUB1 > 10
    PERFORM VARYING WS-SUB2 FROM 1 BY 1 UNTIL WS-SUB2 > 10
       ADD 1 TO WS-COUNTER
    END-PERFORM
END-PERFORM.

DISPLAY "COUNTER = " WS-COUNTER.